finalapp/app/Controllers/Ventas.php

    public function index(){
        $ventaModel = new Venta();
        $data['ventas'] = $ventaModel->findAll();
---
SELECT *
FROM `ventas`

    public function guardarVenta() {
        if ($this->request->getMethod() === 'post') {
            $ventaModel = new Venta();
            $ventaData = [
                'nombrecomprador' => $this->request->getPost('nombrecomprador'),
                'producto' => $this->request->getPost('producto'),
                'cantidad' => $this->request->getPost('cantidad'),
                'precio' => $this->request->getPost('precio'),
                'marca' => $this->request->getPost('marca')
            ];
            $ventaModel->insert($ventaData);
---
INSERT INTO `ventas` (`nombrecomprador`, `producto`, `cantidad`, `precio`, `marca`) VALUES ('mitch', 'arroz', '2', '0.98', 'camil')